// Створіть масив styles з елементами 'Джаз' і 'Блюз'
//Додайте в кінець 'Рок-н-ролл'
//Заменіть значення 'Блюз' на 'Класика'
// Напишіть функцію logItems (array), яка приймає
// масив і використовує цикл for, який для кожного елемента
//буде виводити повідомлення у форматі:
//<номер елемента> - <значення елемента>
//Нумерація має починатись з 1
const styles = ['Джаз', 'Блюз'];
styles.push('Рок-н-ролл');
// styles[1] = 'Класика';
const index = styles.indexOf('Блюз')
if (index !== -1) {
    styles[index] = 'Класика'
}
function logItems(array) {
    for (let i = 0; i < array.length; i++){
        console.log(`${i+1} - ${array[i]}`);
    }
        
};

logItems(styles);